#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
data.azurerm_container_registry.acr: Reading...
module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/b69dedcd-cfb8-4ec6-ba75-987e53dd2fd2/resourceGroups/team4-frontend-cameron-rg-dev]
data.azurerm_container_registry.acr: Read complete after 1s [id=/subscriptions/b69dedcd-cfb8-4ec6-ba75-987e53dd2fd2/resourceGroups/rg-academy-acr/providers/Microsoft.ContainerRegistry/registries/academyacrj3r5dv]
azurerm_container_group.frontend: Refreshing state... [id=/subscriptions/b69dedcd-cfb8-4ec6-ba75-987e53dd2fd2/resourceGroups/team4-frontend-cameron-rg-dev/providers/Microsoft.ContainerInstance/containerGroups/team4-frontend-cameron-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_container_group.frontend must be replaced
-/+ resource "azurerm_container_group" "frontend" {
      ~ dns_name_label              = "team4-frontend-cameron-20260303-dev" -> "team4-frontend-cameron-20260304-dev" # forces replacement
      ~ exposed_port                = [
          - {
              - port     = 3000
              - protocol = "TCP"
            },
        ] -> (known after apply)
      ~ fqdn                        = "team4-frontend-cameron-20260303-dev.uksouth.azurecontainer.io" -> (known after apply)
      ~ id                          = "/subscriptions/b69dedcd-cfb8-4ec6-ba75-987e53dd2fd2/resourceGroups/team4-frontend-cameron-rg-dev/providers/Microsoft.ContainerInstance/containerGroups/team4-frontend-cameron-dev" -> (known after apply)
      ~ ip_address                  = "85.210.74.215" -> (known after apply)
        name                        = "team4-frontend-cameron-dev"
      + network_profile_id          = (known after apply)
      - subnet_ids                  = [] -> null
        tags                        = {
            "environment" = "dev"
        }
      - zones                       = [] -> null
        # (7 unchanged attributes hidden)

      ~ container {
          ~ commands                     = [] -> (known after apply)
          - cpu_limit                    = 0 -> null
          ~ environment_variables        = { # forces replacement
              + "NODE_ENV" = "production"
              + "PORT"     = "3000"
            }
          ~ image                        = "academyacrj3r5dv.azurecr.io/team4-front-app-cameron:latest" -> "academyacrj3r5dv.azurecr.io/team4-front-app-cameron:sha-9e02fc6" # forces replacement
          - memory_limit                 = 0 -> null
            name                         = "frontend"
          - secure_environment_variables = (sensitive value) -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ image_registry_credential {
          ~ password = (sensitive value) # forces replacement
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change.
          ~ username = (sensitive value) # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ container_ip     = "85.210.74.215" -> (known after apply)
  ~ frontend_fqdn    = "team4-frontend-cameron-20260303-dev.uksouth.azurecontainer.io" -> (known after apply)
  ~ frontend_url     = "http://team4-frontend-cameron-20260303-dev.uksouth.azurecontainer.io:3000" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @CameronStewartKainos, Action: `pull_request`, Workflow: `Terraform`*